IDEA Open Model
RebarBase.RebarShape Property
Compatible with IDEA StatiCa 20.1
 Gets or sets the geometrical shape of the rebar. IdeaRS.OpenModel.Model.RebarShape
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public ReferenceElement RebarShape { get; set; }
Public Property RebarShape As ReferenceElement
	Get
	Set
Property Value
Type: ReferenceElement
See Also
Reference
RebarBase Class
IdeaRS.OpenModel.Model Namespace